boat-rental-app/app/controllers/sessions_controller.rb

    def create
        if @user = User.find_by(username: params[:user][:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "hamza"], ["LIMIT", 1]]